           05  FD-KSDS-Key.
              10  FT-Team-Name          pic x(20).
              10  FT-Player-Name        pic x(20).
           05  FT-Games              pic 9(05).
           05  FT-Attempts           pic 9(05).
           05  FT-Completed          pic 9(05).
           05  FT-Three-Pointers     pic 9(05).
           05  FT-Pct-Completed      pic 9(03)v9.
           05  FT-Avg-Points         pic 9(04)v9. 
           05  FT-Last-Update        pic x(08).